console.log(
  ' 📂 Third Part Score: 125 / 125\n\n',

  '✅ [+50] Слайдер изображений в секции destinations:\n',
  '✔️ На десктоп варианте при клике на урезанную картинку слева или справа изображение меняется по принципу карусели (20)\n',
  '✔️ Три точки внизу отображают "номер слайда", то есть каждому слайду соответствует свой кружочек, который становится активным при нахождении соответствующего ему слайда в центре. На мобильном варианте картинка одна, но поверх нее появляются стрелочки навигации (20)\n',
  '✔️ Анимации плавного перемещения для слайдера (10)\n\n',

  '✅ [+50] Нажатие на кнопку Login (кнопка Account в мобильной версии) показывает сверстанный логин попап:\n',
  '✔️ Логин попап соответствует верстке, его закрытие происходит при клике вне попапа (25)\n',
  '✔️ Логин попап имеет 2 инпута (логин и пароль), при нажатии на кнопку Sign In показывается браузерный алерт с введенными данными (25)\n\n',

  '✅ [+25] Нажатие на кнопку Register на Login попапе меняет разметку попапа на разметку Sign Up попапа согласно макету. Нажатие не закрывает модал, а просто меняет его наполнение.\n\n\n',


  '📂 Second Part Score: 85 / 85\n\n',

  '✅ [+48] Вёрстка соответствует макету. Ширина экрана 390px:\n',
  '✔️ Блок header (6)\n',
  '✔️ Секция preview (9)\n',
  '✔️ Секция steps (9)\n',
  '✔️ Секция destinations (9)\n',
  '✔️ Секция stories (9)\n',
  '✔️ Блок footer (6)\n\n',

  '✅ [+15] Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки. Весь контент страницы при этом сохраняется: не обрезается и не удаляется:\n',
  '✔️ Нет полосы прокрутки при ширине страницы от 1440рх до 390px (7)\n',
  '✔️ Нет полосы прокрутки при ширине страницы от 390px до 320рх (8)\n\n',
  
  '✅ [+22] На ширине экрана 390рх и меньше реализовано адаптивное меню:\n',
  '✔️ При ширине страницы 390рх панель навигации скрывается, появляется бургер-иконка (2)\n',
  '✔️ При нажатии на бургер-иконку плавно появляется адаптивное меню (4)\n',
  '✔️ Аадаптивное меню соответствует макету (4)\n',
  '✔️ При нажатии на крестик адаптивное меню плавно скрывается, уезжая за экран (4)\n',
  '✔️ Ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям (4)\n',
  '✔️ При клике по ссылке в адаптивном меню адаптивное меню плавно скрывается, также скрытие меню происходит, если сделать клик вне данного окна (4)\n\n\n',
  
  
  '📂 First Part Score: 110 / 110\n\n',

  '✅ [+10] Вёрстка валидная\n',
  '✔️ Проверено https://validator.w3.org No errors or warnings to show (10)\n\n',
  
  '✅ [+20] Вёрстка семантическая:\n',
  '✔️ Присутствуют элементы <header>, <main>, <footer> (3)\n',
  '✔️ Четыре элемента <section> (3)\n',
  '✔️ Только один заголовок <h1> (3)\n',
  '✔️ Три заголовка <h2> (3)\n',
  '✔️ Один элемент <nav> в панели навигации (3)\n',
  '✔️ Два списка ul > li > a в панели навигации и ссылках на соцсети (3)\n',
  '✔️ Четыре кнопки <button> (2)\n\n',
  
  '✅ [+48] Вёрстка соответствует макету:\n',
  '✔️ Блок <header> (6)\n',
  '✔️ Секция preview (9)\n',
  '✔️ Секция steps (9)\n',
  '✔️ Секция destinations (9)\n',
  '✔️ Секция stories (9)\n',
  '✔️ Блок <footer> (6)\n\n',
    
  '✅ [+12] Требования к css:\n',
  '✔️ Для построения сетки используются флексы (2)\n',
  '✔️ При уменьшении масштаба страницы вёрстка размещается по центру (2)\n',
  '✔️ Фоновый цвет тянется на всю ширину страницы (2)\n',
  '✔️ Иконки добавлены в формате .svg (2)\n',
  '✔️ Изображения добавлены в формате .jpg (2)\n',
  '✔️ Есть favicon (2)\n\n',
  
  '✅ [+20] Интерактивность реализована через css:\n',
  '✔️ Плавная прокрутка по якорям (5)\n',
  '✔️ Иконки соцсетей в футере ведут на гитхаб автора https://github.com/mshns и на страницу курса https://rs.school/js-stage0/ (5)\n',
  '✔️ Интерактивность включает изменение внешнего вида курсора и другие визуальные эффекты - изменение цвета фона и текста, а также формы элементов при наведении (5)\n',
  '✔️ Плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы (5)'
  );