console.log(
  'Score: 110 / 110\n\n',
  '[+10] Вёрстка валидная, проверено https://validator.w3.org No errors or warnings to show (10)\n\n',
  
  '[+20] Вёрстка семантическая:\n',
  '- Присутствуют элементы <header>, <main>, <footer> (3)\n',
  '- Четыре элемента <section> (3)\n',
  '- Только один заголовок <h1> (3)\n',
  '- Три заголовка <h2> (3)\n',
  '- Один элемент <nav> в панели навигации (3)\n',
  '- Два списка ul > li > a в панели навигации и ссылках на соцсети (3)\n',
  '- Четыре кнопки <button> (2)\n\n',
  
  '[+48] Вёрстка соответствует макету:\n',
  '- Блок <header> (6)\n',
  '- Секция preview (9)\n',
  '- Секция steps (9)\n',
  '- Секция destinations (9)\n',
  '- Секция stories (9)\n',
  '- Блок <footer> (6)\n\n',
    
  '[+12] Требования к css:\n',
  '- Для построения сетки используются флексы (2)\n',
  '- При уменьшении масштаба страницы вёрстка размещается по центру (2)\n',
  '- Фоновый цвет тянется на всю ширину страницы (2)\n',
  '- Иконки добавлены в формате .svg (2)\n',
  '- Изображения добавлены в формате .jpg (2)\n',
  '- Есть favicon (2)\n\n',
  
  '[+20] Интерактивность реализована через css:\n',
  '- Плавная прокрутка по якорям (5)\n',
  '- Иконки соцсетей в футере ведут на гитхаб автора https://github.com/mshns и на страницу курса https://rs.school/js-stage0/ (5)\n',
  '- Интерактивность включает изменение внешнего вида курсора и другие визуальные эффекты - изменение цвета фона и текста, а также формы элементов при наведении (5)\n',
  '- Плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы (5)'
  );